// Написать три функции, которые получают строку, подсчитывают ивозвращают ее длину, но для работы со строкой используют разные циклы:while, for, do...while.
// Написать программу, в которой вводится строка и подсчитывается еедлина, путем обращения к каждой из написанных функций. После каждоговызова функции исходная строка и ее длина выводятся на экран.
#include <stdio.h>
#include <stdlib.h>
const int M=50;
int count_wh(char*);
int count_for(char*);
int count_dwh(char*);
int main(){
           char str[M];
           printf("Введите строку:\n");
           gets(str);
printf("%s - %d знаков.\n",str,count_wh(str));
printf("%s - %d знаков.\n",str,count_for(str));
           printf("%s - %d знаков.\n",str,count_dwh(str));
str[0]=getch;
return 0;
}
int count_wh(char* s){    
           int i=0;
           while(s[i]!='\0')
                          i++;
return i;
} 
int count_for(char* s){
           int i;
           for(i=0;s[i]!='\0';i++){}
return i;
} int count_dwh(char* s){
           int i=-1;
           do i++;
           while(s[i]!='\0');
           if(i==-1)
                          i=0;

return i;
}
